#include <iostream>
#include <conio.h>

using namespace std;

//1. 맵 만들기 o
//2. 맵에 장애물 배치 o
//3. 플레이어블 캐릭터 생성 o
//4. 캐릭터는 방향키로 이동 o ?
//5. 적 생성 ?
//6. 적은 최단 경로 dfs / bfs 로 플레이어를 따라옴 ?

// 골인 지점 있고 최단 경로 역탐색

const int ROW = 10; //맵의 행 크기
const int COL = 20; //맵의 열 크기

char map[ROW][COL] = { //맵 배열
    {'*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*'},
    {'*', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
    {'*', ' ', '*', ' ', '*', ' ', '*', '*', '*', '*', '*', ' ', '*', '*', '*', '*', ' ', '*', ' ', '*'},
    {'*', ' ', '*', ' ', '*', ' ', ' ', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', '*', ' ', '*', ' ', '*'},
    {'*', ' ', '*', ' ', ' ', ' ', '*', ' ', ' ', ' ', '*', ' ', '*', '*', ' ', '*', ' ', '*', ' ', '*'},
    {'*', ' ', '*', '*', '*', '*', '*', ' ', ' ', ' ', '*', ' ', ' ', ' ', ' ', '*', ' ', '*', ' ', '*'},
    {'*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', '*', '*', '*', '*', ' ', '*', ' ', '*', ' ', '*'},
    {'*', ' ', '*', '*', '*', ' ', '*', ' ', '*', ' ', ' ', ' ', ' ', ' ', ' ', '*', ' ', '*', ' ', '*'},
    {'*', ' ', ' ', ' ', '*', ' ', ' ', ' ', '*', ' ', '*', '*', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '*'},
    {'*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*', '*'}
};

int main() {
    int x = 1; //O 초기 x좌표
    int y = 1; //O 초기 y좌표

    int x2 = 18;
    int y2 = 8;

    // 맵 출력
    for (int i = 0; i < ROW; i++) {
        for (int j = 0; j < COL; j++) {
            if (i == y && j == x) { //O의 위치일 때
                cout << 'O';
            }
            else if (i == y2 && j == x2) {
                cout << 'X';
            }
            else {
                cout << map[i][j];
            }
        }
        cout << endl;
    }

    //키보드 이동
    while (true) {
        if(_kbhit()){
            char input = _getch(); //입력받은 키 저장
            //input = getchar();

            int new_x = x; // 새로운 x 좌표
            int new_y = y; // 새로운 y 좌표

            int new_x2 = x2;
            int new_y2 = y2;

            //입력받은 키에 따라 새로운 위치 계산
            switch (input) {
            case 'w':
                new_y--;
                break;
            case 'a':
                new_x--;
                break;
            case 's':
                new_y++;
                break;
            case 'd':
                new_x++;
                break;
            default:
                break;
            }

            if (input == 27) //ESC 누르면 종료
            {
                break;
            }

            if (map[new_y][new_x] == '*') {
                continue;
            }

            //새로운 위치로 O 이동
            x = new_x;
            y = new_y;

            system("cls");

            for (int i = 0; i < ROW; i++) {
                for (int j = 0; j < COL; j++) {
                    if (i == y && j == x) { // O의 위치일 때
                        cout << 'O';
                    }
                    else if (j == y2 && j == x2) {
                        cout << 'X';
                    }
                    else {
                        cout << map[i][j];
                    }
                }
                cout << endl;
            }
        }
    }

    return 0;
}
